<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Imports" data-toc-modified-id="Imports-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Utility-Functions" data-toc-modified-id="Utility-Functions-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Utility Functions</a></span></li><li><span><a href="#Create-Tables" data-toc-modified-id="Create-Tables-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create Tables</a></span></li><li><span><a href="#Wikibooks-SQL-Exercise:-Employee-management" data-toc-modified-id="Wikibooks-SQL-Exercise:-Employee-management-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Wikibooks SQL Exercise: Employee management</a></span><ul class="toc-item"><li><span><a href="#data:-Movies" data-toc-modified-id="data:-Movies-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>data: Movies</a></span></li><li><span><a href="#data:-MovieTheaters" data-toc-modified-id="data:-MovieTheaters-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>data: MovieTheaters</a></span></li><li><span><a href="#data:-combined-data" data-toc-modified-id="data:-combined-data-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>data: combined data</a></span></li><li><span><a href="#merge-two-dataframes-using-pyspark" data-toc-modified-id="merge-two-dataframes-using-pyspark-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>merge two dataframes using pyspark</a></span></li><li><span><a href="#spark-dataframe-attributes" data-toc-modified-id="spark-dataframe-attributes-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>spark dataframe attributes</a></span></li></ul></li><li><span><a href="#Create-SQL-table-from-spark-dataframes" data-toc-modified-id="Create-SQL-table-from-spark-dataframes-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Create SQL table from spark dataframes</a></span></li><li><span><a href="#Exercise-Questions" data-toc-modified-id="Exercise-Questions-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Exercise Questions</a></span><ul class="toc-item"><li><span><a href="#1.-Select-the-title-of-all-movies." data-toc-modified-id="1.-Select-the-title-of-all-movies.-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>1. Select the title of all movies.</a></span></li><li><span><a href="#2.-Show-all-the-distinct-ratings-in-the-database." data-toc-modified-id="2.-Show-all-the-distinct-ratings-in-the-database.-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>2. Show all the distinct ratings in the database.</a></span></li><li><span><a href="#3.-Show-all-unrated-movies." data-toc-modified-id="3.-Show-all-unrated-movies.-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>3. Show all unrated movies.</a></span></li><li><span><a href="#4.-Select-all-movie-theaters-that-are-not-currently-showing-a-movie." data-toc-modified-id="4.-Select-all-movie-theaters-that-are-not-currently-showing-a-movie.-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>4. Select all movie theaters that are not currently showing a movie.</a></span></li><li><span><a href="#5.-Select-all-data-from-all-movie-theaters-and,-additionally,-the-data-from-the-movie-that-is-being-shown-in-the-theater-(if-one-is-being-shown)." data-toc-modified-id="5.-Select-all-data-from-all-movie-theaters-and,-additionally,-the-data-from-the-movie-that-is-being-shown-in-the-theater-(if-one-is-being-shown).-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>5. Select all data from all movie theaters and, additionally, the data from the movie that is being shown in the theater (if one is being shown).</a></span></li><li><span><a href="#6.-Select-all-data-from-all-movies-and,-if-that-movie-is-being-shown-in-a-theater,-show-the-data-from-the-theater." data-toc-modified-id="6.-Select-all-data-from-all-movies-and,-if-that-movie-is-being-shown-in-a-theater,-show-the-data-from-the-theater.-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>6. Select all data from all movies and, if that movie is being shown in a theater, show the data from the theater.</a></span></li><li><span><a href="#7.-Show-the-titles-of-movies-not-currently-being-shown-in-any-theaters." data-toc-modified-id="7.-Show-the-titles-of-movies-not-currently-being-shown-in-any-theaters.-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>7. Show the titles of movies not currently being shown in any theaters.</a></span></li><li><span><a href="#8.-Add-the-unrated-movie-&quot;One,-Two,-Three&quot;." data-toc-modified-id="8.-Add-the-unrated-movie-&quot;One,-Two,-Three&quot;.-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>8. Add the unrated movie "One, Two, Three".</a></span></li><li><span><a href="#9.-Set-the-rating-of-all-unrated-movies-to-&quot;G&quot;." data-toc-modified-id="9.-Set-the-rating-of-all-unrated-movies-to-&quot;G&quot;.-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>9. Set the rating of all unrated movies to "G".</a></span></li><li><span><a href="#10.-Remove-movie-theaters-projecting-movies-rated-&quot;NC-17&quot;." data-toc-modified-id="10.-Remove-movie-theaters-projecting-movies-rated-&quot;NC-17&quot;.-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>10. Remove movie theaters projecting movies rated "NC-17".</a></span></li></ul></li><li><span><a href="#Time-Taken" data-toc-modified-id="Time-Taken-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Time Taken</a></span></li></ul></div>

# Imports

- https://en.wikibooks.org/wiki/SQL_Exercises
- https://en.wikibooks.org/wiki/SQL_Exercises/Movie_theatres

In [1]:
import time
time_start_notebook = time.time()

In [2]:
from bhishan import bp # my personal library

/Users/poudel/miniconda3/envs/dataSc/lib/python3.7/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [3]:
import numpy as np
import pandas as pd

# Jupyter notebook settings for pandas
pd.set_option('display.max_columns', 200)
pd.set_option('display.max_rows', 100)

In [4]:
from datetime import datetime
from dateutil.relativedelta import relativedelta
# last_year = datetime.now() - relativedelta(years=1)

import sqlite3
sqlite3.sqlite_version # sqlite database version 3.29
sqlite3.version # python module version

'2.6.0'

In [5]:
# pyspark
import pyspark
spark = pyspark.sql.SparkSession.builder.appName('bhishan').getOrCreate()
print([(x.__name__,x.__version__) for x in [np, pd, pyspark]])

# sql
from pyspark.sql.functions import col as _col
from pyspark.sql.functions import udf # @udf("integer") def myfunc(x,y): return x - y
from pyspark.sql import functions as F # stddev format_number date_format, dayofyear, when
from pyspark.sql.window import Window

from pyspark.sql.functions import (mean as _mean, min as _min,
                                   max as _max, avg as _avg,
                                   when as _when
                                  )

from pyspark.sql.types import StructField, StructType
from pyspark.sql.types import IntegerType, FloatType, DoubleType,StringType

[('numpy', '1.18.1'), ('pandas', '1.0.1'), ('pyspark', '2.4.4')]

In [6]:
from pyspark import SparkConf, SparkContext, SQLContext

spark = pyspark.sql.SparkSession.builder.appName('app').getOrCreate()
sc = spark.sparkContext
sqlContext = SQLContext(sc) # spark_df = sqlContext.createDataFrame(pandas_df)
sc.setLogLevel("INFO")

# Utility Functions

In [7]:
def f(q,n=None):
    return pd.read_sql(q,conn).head(n)

def s(q,n=5):
    sdf = spark.sql(q)
    print(f'nrows: {sdf.count()}, ncols: {len(sdf.columns)}')
    return sdf.show(n)

# Create Tables

In [8]:
# create db if does not exist
conn = sqlite3.connect("mydb.db")
cur = conn.cursor()

In [9]:
try:
    cur.execute("drop table if exists Movies")
except:
    pass

In [10]:
cur.execute(
"""
 CREATE TABLE Movies (
   Code INTEGER PRIMARY KEY NOT NULL,
   Title TEXT NOT NULL,
   Rating TEXT 
 )
""")

In [11]:
try:
    cur.execute("drop table if exists MovieTheaters")
except:
    pass

In [12]:
cur.execute(
"""
 CREATE TABLE MovieTheaters (
   Code INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL,
   Movie INTEGER  
     CONSTRAINT fk_Movies_Code REFERENCES Movies(Code)
 )
""")

In [13]:
data = """
 INSERT INTO Movies(Code,Title,Rating) VALUES(9,'Citizen King','G');
 INSERT INTO Movies(Code,Title,Rating) VALUES(1,'Citizen Kane','PG');
 INSERT INTO Movies(Code,Title,Rating) VALUES(2,'Singin'' in the Rain','G');
 INSERT INTO Movies(Code,Title,Rating) VALUES(3,'The Wizard of Oz','G');
 INSERT INTO Movies(Code,Title,Rating) VALUES(4,'The Quiet Man',NULL);
 INSERT INTO Movies(Code,Title,Rating) VALUES(5,'North by Northwest',NULL);
 INSERT INTO Movies(Code,Title,Rating) VALUES(6,'The Last Tango in Paris','NC-17');
 INSERT INTO Movies(Code,Title,Rating) VALUES(7,'Some Like it Hot','PG-13');
 INSERT INTO Movies(Code,Title,Rating) VALUES(8,'A Night at the Opera',NULL);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(1,'Odeon',5);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(2,'Imperial',1);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(3,'Majestic',NULL);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(4,'Royale',6);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(5,'Paraiso',3);
 INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(6,'Nickelodeon',NULL);
""".split('\n')

for i,line in enumerate(data):
    if line:
        cur.execute(line.strip())
        
        
conn.commit()

# Wikibooks SQL Exercise: Employee management
Relational Schema  
(Right click the image, inspect and copy the element)  


<img alt="Sql movie theaters.png" src="//upload.wikimedia.org/wikipedia/commons/f/ff/Sql_movie_theaters.png" decoding="async" width="605" height="78" data-file-width="605" data-file-height="78">

## data: Movies

In [14]:
pd.read_sql("select * from Movies", conn).pipe(print)

   Code                    Title Rating
0     1             Citizen Kane     PG
1     2      Singin' in the Rain      G
2     3         The Wizard of Oz      G
3     4            The Quiet Man   None
4     5       North by Northwest   None
5     6  The Last Tango in Paris  NC-17
6     7         Some Like it Hot  PG-13
7     8     A Night at the Opera   None
8     9             Citizen King      G

In [15]:
dfm = pd.DataFrame({
    'Code': range(1,10),
    'Title': ['Citizen Kane', "Singin' in the Rain",
              'The Wizard of Oz', 'The Quiet Man',
              'North by Northwest', 'The Last Tango in Paris',
              'Some Like it Hot', 'A Night at the Opera',
              'Citizen King'],
    'Rating': ['PG', 'G', 'G',
                    None, None, 'NC-17',
                    'PG-13', None, 'G']})
dfm

   Code                    Title Rating
0     1             Citizen Kane     PG
1     2      Singin' in the Rain      G
2     3         The Wizard of Oz      G
3     4            The Quiet Man   None
4     5       North by Northwest   None
5     6  The Last Tango in Paris  NC-17
6     7         Some Like it Hot  PG-13
7     8     A Night at the Opera   None
8     9             Citizen King      G

In [16]:
dfm.dtypes

Code       int64
Title     object
Rating    object
dtype: object

In [17]:
schema = StructType([
    StructField('Code',IntegerType(),True),
    StructField('Title',StringType(),True),
    StructField('Rating',StringType(),True),
    ])

sdfm = sqlContext.createDataFrame(dfm, schema)
sdfm.show()

+----+--------------------+------+
|Code|               Title|Rating|
+----+--------------------+------+
|   1|        Citizen Kane|    PG|
|   2| Singin' in the Rain|     G|
|   3|    The Wizard of Oz|     G|
|   4|       The Quiet Man|  null|
|   5|  North by Northwest|  null|
|   6|The Last Tango in...| NC-17|
|   7|    Some Like it Hot| PG-13|
|   8|A Night at the Opera|  null|
|   9|        Citizen King|     G|
+----+--------------------+------+

## data: MovieTheaters

In [18]:
pd.read_sql("select * from MovieTheaters", conn).pipe(print)

   Code         Name  Movie
0     1        Odeon    5.0
1     2     Imperial    1.0
2     3     Majestic    NaN
3     4       Royale    6.0
4     5      Paraiso    3.0
5     6  Nickelodeon    NaN

In [19]:
dft = pd.DataFrame({
    'Code': [1, 2, 3, 4, 5, 6],
    'Name': ['Odeon', 'Imperial', 'Majestic',
             'Royale', 'Paraiso', 'Nickelodeon'],
    'Movie': [5.0, 1.0, np.nan, 6.0, 3.0, np.nan]})
dft

   Code         Name  Movie
0     1        Odeon    5.0
1     2     Imperial    1.0
2     3     Majestic    NaN
3     4       Royale    6.0
4     5      Paraiso    3.0
5     6  Nickelodeon    NaN

In [20]:
dft.dtypes

Code       int64
Name      object
Movie    float64
dtype: object

In [21]:
schema = StructType([
    StructField('Code',IntegerType(),True),
    StructField('Name',StringType(),True),
    StructField('Movie',FloatType(),True),

    ])

sdft = sqlContext.createDataFrame(dft, schema)
sdft.show()

+----+-----------+-----+
|Code|       Name|Movie|
+----+-----------+-----+
|   1|      Odeon|  5.0|
|   2|   Imperial|  1.0|
|   3|   Majestic|  NaN|
|   4|     Royale|  6.0|
|   5|    Paraiso|  3.0|
|   6|Nickelodeon|  NaN|
+----+-----------+-----+

In [22]:
# sdft.printSchema()

## data: combined data

In [23]:
df = dfm.merge(dft,left_on='Code', right_on='Movie',suffixes=['_m','_t'])
df

   Code_m                    Title Rating  Code_t      Name  Movie
0       1             Citizen Kane     PG       2  Imperial    1.0
1       3         The Wizard of Oz      G       5   Paraiso    3.0
2       5       North by Northwest   None       1     Odeon    5.0
3       6  The Last Tango in Paris  NC-17       4    Royale    6.0

## merge two dataframes using pyspark

- we need to rename common columns of two tables.

In [24]:
cols1 = sdft.columns
cols2  = sdfm.columns
cols_common = set(cols1) & set(cols2)
cols1, cols2, cols_common

(['Code', 'Name', 'Movie'], ['Code', 'Title', 'Rating'], {'Code'})

In [25]:
# rename common columns of first spark dataframe.

In [26]:
sdfm2 = sdfm.withColumnRenamed('Code','Code_m')
sdfm2.show(2)

+------+-------------------+------+
|Code_m|              Title|Rating|
+------+-------------------+------+
|     1|       Citizen Kane|    PG|
|     2|Singin' in the Rain|     G|
+------+-------------------+------+
only showing top 2 rows

In [27]:
# rename common columns of second spark dataframe.

In [28]:
sdft2 = sdft.withColumnRenamed('Code','Code_t')
sdft2.show(2)

+------+--------+-----+
|Code_t|    Name|Movie|
+------+--------+-----+
|     1|   Odeon|  5.0|
|     2|Imperial|  1.0|
+------+--------+-----+
only showing top 2 rows

In [29]:
# now join two spark dataframes which have different column names.

In [30]:
sdf = sdfm2.join(sdft2,sdfm2.Code_m==sdft2.Movie)
sdf.show()

+------+--------------------+------+------+--------+-----+
|Code_m|               Title|Rating|Code_t|    Name|Movie|
+------+--------------------+------+------+--------+-----+
|     5|  North by Northwest|  null|     1|   Odeon|  5.0|
|     3|    The Wizard of Oz|     G|     5| Paraiso|  3.0|
|     1|        Citizen Kane|    PG|     2|Imperial|  1.0|
|     6|The Last Tango in...| NC-17|     4|  Royale|  6.0|
+------+--------------------+------+------+--------+-----+

## spark dataframe attributes

In [31]:
bp.show_method_attributes(sdf,4)
# count, fillna, filter, where, groubpy, first, corr,
# missing than pandas: max, min, sum, etc.

,0,1,2,3
0,agg,dropDuplicates,join,sortWithinPartitions
1,alias,drop_duplicates,limit,sql_ctx
2,approxQuantile,dropna,localCheckpoint,stat
3,cache,dtypes,na,storageLevel
4,checkpoint,exceptAll,orderBy,subtract
5,coalesce,explain,persist,summary
6,colRegex,fillna,printSchema,take
7,collect,filter,randomSplit,toDF
8,columns,first,rdd,toJSON
9,corr,foreach,registerTempTable,toLocalIterator
10,count,foreachPartition,repartition,toPandas
11,cov,freqItems,repartitionByRange,union
12,createGlobalTempView,groupBy,replace,unionAll
13,createOrReplaceGlobalTempView,groupby,rollup,unionByName
14,createOrReplaceTempView,head,sample,unpersist
15,createTempView,hint,sampleBy,where
16,crossJoin,intersect,schema,withColumn
17,crosstab,intersectAll,select,withColumnRenamed
18,cube,isLocal,selectExpr,withWatermark
19,describe,isStreaming,show,write
20,distinct,is_cached,sort,writeStream
21,drop,,,

# Create SQL table from spark dataframes

- https://spark.apache.org/docs/2.2.0/sql-programming-guide.html

**Global Temporary View** 

Temporary views in Spark SQL are session-scoped and will disappear if the session that creates it terminates. If you want to have a temporary view that is shared among all sessions and keep alive until the Spark application terminates, you can create a global temporary view. Global temporary view is tied to a system preserved database global_temp, and we must use the qualified name to refer it, e.g. `SELECT * FROM global_temp.view1`.

In [32]:
# Register the DataFrame as a SQL temporary view
sdfm.createOrReplaceTempView("Movies")
sdft.createOrReplaceTempView("MovieTheaters")
sdf.createOrReplaceTempView("sdf")

spark.sql('select * from Movies limit 2').show()

+----+-------------------+------+
|Code|              Title|Rating|
+----+-------------------+------+
|   1|       Citizen Kane|    PG|
|   2|Singin' in the Rain|     G|
+----+-------------------+------+

# Exercise Questions

## 1. Select the title of all movies.

In [33]:
# dfm['Title']

In [34]:
# sdfm.select('Title').show()

In [35]:
q = """select title from Movies""";
# f(q)

In [36]:
# s(q)

## 2. Show all the distinct ratings in the database.

In [37]:
dfm['Rating'].unique()

array(['PG', 'G', None, 'NC-17', 'PG-13'], dtype=object)

In [38]:
sdfm.select('Rating').distinct().show()

+------+
|Rating|
+------+
|  null|
|    PG|
| NC-17|
|     G|
| PG-13|
+------+

In [39]:
q = "select distinct rating from Movies"
# f(q)

In [40]:
# s(q)

## 3. Show all unrated movies.

In [41]:
dfm[dfm.Rating.isnull()]

   Code                 Title Rating
3     4         The Quiet Man   None
4     5    North by Northwest   None
7     8  A Night at the Opera   None

In [42]:
sdfm.filter(sdfm.Rating.isNull()).show()

+----+--------------------+------+
|Code|               Title|Rating|
+----+--------------------+------+
|   4|       The Quiet Man|  null|
|   5|  North by Northwest|  null|
|   8|A Night at the Opera|  null|
+----+--------------------+------+

In [43]:
q = "select * from Movies where Rating is null"
# f(q)

In [44]:
s(q)

nrows: 3, ncols: 3
+----+--------------------+------+
|Code|               Title|Rating|
+----+--------------------+------+
|   4|       The Quiet Man|  null|
|   5|  North by Northwest|  null|
|   8|A Night at the Opera|  null|
+----+--------------------+------+

## 4. Select all movie theaters that are not currently showing a movie.

In [45]:
dft[dft.Movie.isnull()]

   Code         Name  Movie
2     3     Majestic    NaN
5     6  Nickelodeon    NaN

In [46]:
sdft.filter(sdft.Movie.isNull()).show() # fails, gives empty result
sdft.where(F.isnull('Movie')).show() # gives empty result

+----+----+-----+
|Code|Name|Movie|
+----+----+-----+
+----+----+-----+

+----+----+-----+
|Code|Name|Movie|
+----+----+-----+
+----+----+-----+

In [47]:
spark.sql("""select * from MovieTheaters where Movie = 'NaN' """).show()

+----+-----------+-----+
|Code|       Name|Movie|
+----+-----------+-----+
|   3|   Majestic|  NaN|
|   6|Nickelodeon|  NaN|
+----+-----------+-----+

In [48]:
spark.sql("select * from MovieTheaters where isnan(Movie)").show()

+----+-----------+-----+
|Code|       Name|Movie|
+----+-----------+-----+
|   3|   Majestic|  NaN|
|   6|Nickelodeon|  NaN|
+----+-----------+-----+

In [49]:
q = 'select * from MovieTheaters where Movie is null'
f(q)

   Code         Name Movie
0     3     Majestic  None
1     6  Nickelodeon  None

In [50]:
s(q)

nrows: 0, ncols: 3
+----+----+-----+
|Code|Name|Movie|
+----+----+-----+
+----+----+-----+

## 5. Select all data from all movie theaters and, additionally, the data from the movie that is being shown in the theater (if one is being shown).

In [51]:
dft.head(1)

   Code   Name  Movie
0     1  Odeon    5.0

In [52]:
dfm.head(1)

   Code         Title Rating
0     1  Citizen Kane     PG

In [53]:
dft.merge(dfm,left_on='Movie',right_on='Code',how='left',suffixes=['_t','_m'])
# left join also include nulls.

   Code_t         Name  Movie  Code_m                    Title Rating
0       1        Odeon    5.0     5.0       North by Northwest   None
1       2     Imperial    1.0     1.0             Citizen Kane     PG
2       3     Majestic    NaN     NaN                      NaN    NaN
3       4       Royale    6.0     6.0  The Last Tango in Paris  NC-17
4       5      Paraiso    3.0     3.0         The Wizard of Oz      G
5       6  Nickelodeon    NaN     NaN                      NaN    NaN

In [54]:
(sdft2
 .join(sdfm2,
       sdfm2.Code_m==sdft2.Movie,
       how='left'
      )

 .show()
)

+------+-----------+-----+------+--------------------+------+
|Code_t|       Name|Movie|Code_m|               Title|Rating|
+------+-----------+-----+------+--------------------+------+
|     1|      Odeon|  5.0|     5|  North by Northwest|  null|
|     5|    Paraiso|  3.0|     3|    The Wizard of Oz|     G|
|     2|   Imperial|  1.0|     1|        Citizen Kane|    PG|
|     4|     Royale|  6.0|     6|The Last Tango in...| NC-17|
|     3|   Majestic|  NaN|  null|                null|  null|
|     6|Nickelodeon|  NaN|  null|                null|  null|
+------+-----------+-----+------+--------------------+------+

In [55]:
q = """
select *
from MovieTheaters t
left join Movies m
on m.code = t.movie
"""

f(q,6)

   Code         Name  Movie  Code                    Title Rating
0     1        Odeon    5.0   5.0       North by Northwest   None
1     2     Imperial    1.0   1.0             Citizen Kane     PG
2     3     Majestic    NaN   NaN                     None   None
3     4       Royale    6.0   6.0  The Last Tango in Paris  NC-17
4     5      Paraiso    3.0   3.0         The Wizard of Oz      G
5     6  Nickelodeon    NaN   NaN                     None   None

## 6. Select all data from all movies and, if that movie is being shown in a theater, show the data from the theater.

In [56]:
q = """
select *
from MovieTheaters t
right join Movies m
on m.code=t.movie
"""

s(q,9)

nrows: 9, ncols: 6
+----+--------+-----+----+--------------------+------+
|Code|    Name|Movie|Code|               Title|Rating|
+----+--------+-----+----+--------------------+------+
|null|    null| null|   9|        Citizen King|     G|
|   1|   Odeon|  5.0|   5|  North by Northwest|  null|
|null|    null| null|   7|    Some Like it Hot| PG-13|
|null|    null| null|   2| Singin' in the Rain|     G|
|   5| Paraiso|  3.0|   3|    The Wizard of Oz|     G|
|   2|Imperial|  1.0|   1|        Citizen Kane|    PG|
|   4|  Royale|  6.0|   6|The Last Tango in...| NC-17|
|null|    null| null|   8|A Night at the Opera|  null|
|null|    null| null|   4|       The Quiet Man|  null|
+----+--------+-----+----+--------------------+------+

## 7. Show the titles of movies not currently being shown in any theaters.

In [57]:
dfm

   Code                    Title Rating
0     1             Citizen Kane     PG
1     2      Singin' in the Rain      G
2     3         The Wizard of Oz      G
3     4            The Quiet Man   None
4     5       North by Northwest   None
5     6  The Last Tango in Paris  NC-17
6     7         Some Like it Hot  PG-13
7     8     A Night at the Opera   None
8     9             Citizen King      G

In [58]:
dft

   Code         Name  Movie
0     1        Odeon    5.0
1     2     Imperial    1.0
2     3     Majestic    NaN
3     4       Royale    6.0
4     5      Paraiso    3.0
5     6  Nickelodeon    NaN

In [59]:
# I see only moives 1,3,5,6 are showing in theaters.
# movies 2,4,7-9 are not being shown in any theater.

# 2	Singin' in the Rain	G
# 4	The Quiet Man	None

In [60]:
q = """
select *
from Movies m
left join MovieTheaters t
on t.movie = m.code
where t.movie is null
"""

s(q,6)

nrows: 5, ncols: 6
+----+--------------------+------+----+----+-----+
|Code|               Title|Rating|Code|Name|Movie|
+----+--------------------+------+----+----+-----+
|   9|        Citizen King|     G|null|null| null|
|   7|    Some Like it Hot| PG-13|null|null| null|
|   2| Singin' in the Rain|     G|null|null| null|
|   8|A Night at the Opera|  null|null|null| null|
|   4|       The Quiet Man|  null|null|null| null|
+----+--------------------+------+----+----+-----+

In [61]:
q = """
select title
from Movies m
where code not in
(
  select movie from MovieTheaters where movie is not null
)
"""

f(q,9)

                  Title
0   Singin' in the Rain
1         The Quiet Man
2      Some Like it Hot
3  A Night at the Opera
4          Citizen King

## 8. Add the unrated movie "One, Two, Three".

In [62]:
q = "INSERT INTO Movies(Title,Rating) VALUES('One, Two, Three',NULL);"
cur.execute(q)
conn.commit()

pd.read_sql('select * from Movies',conn)

   Code                    Title Rating
0     1             Citizen Kane     PG
1     2      Singin' in the Rain      G
2     3         The Wizard of Oz      G
3     4            The Quiet Man   None
4     5       North by Northwest   None
5     6  The Last Tango in Paris  NC-17
6     7         Some Like it Hot  PG-13
7     8     A Night at the Opera   None
8     9             Citizen King      G
9    10          One, Two, Three   None

## 9. Set the rating of all unrated movies to "G".

In [63]:
q = "UPDATE Movies SET Rating='G' WHERE Rating IS NULL;"
cur.execute(q)
conn.commit()

pd.read_sql('select * from Movies',conn)

   Code                    Title Rating
0     1             Citizen Kane     PG
1     2      Singin' in the Rain      G
2     3         The Wizard of Oz      G
3     4            The Quiet Man      G
4     5       North by Northwest      G
5     6  The Last Tango in Paris  NC-17
6     7         Some Like it Hot  PG-13
7     8     A Night at the Opera      G
8     9             Citizen King      G
9    10          One, Two, Three      G

## 10. Remove movie theaters projecting movies rated "NC-17".

In [64]:
q = """
DELETE FROM MovieTheaters WHERE Movie IN
   (SELECT Code FROM Movies WHERE Rating = 'NC-17');
""".strip()
cur.execute(q)
conn.commit()

pd.read_sql('select * from MovieTheaters',conn)

   Code         Name  Movie
0     1        Odeon    5.0
1     2     Imperial    1.0
2     3     Majestic    NaN
3     5      Paraiso    3.0
4     6  Nickelodeon    NaN

# Time Taken

In [65]:
time_taken = time.time() - time_start_notebook
h,m = divmod(time_taken,60*60)
print('Time taken: {:.0f} hr {:.0f} min {:.0f} secs'.format(h, *divmod(m,60)))

Time taken: 0 hr 0 min 27 secs